app/Models/Admin/AlatPengajaranModel.php

    public function getAlatPengajaran()
    {
        return $this->table($this->table)
            ->select("alat_pengajaran_table.id, alat_pengajaran_table.materi_belajar, alat_pengajaran_table.link")
            ->orderBy('alat_pengajaran_table.id desc')
            ->get()->getResultObject();
---
SELECT `alat_pengajaran_table`.`id`, `alat_pengajaran_table`.`materi_belajar`, `alat_pengajaran_table`.`link`
FROM `alat_pengajaran_table`
ORDER BY `alat_pengajaran_table`.`id` desc