app/Models/Admin/KelompokModel.php

    public function getKelompokPengajar()
    {
        return $this->table($this->table)
            ->select("kelompok_table.id, kelompok_table.kelompok, kelompok_table.mitra_pengajar_id, data_pengajar_table.nama_lengkap")
            ->join('data_pengajar_table', 'data_pengajar_table.id = kelompok_table.mitra_pengajar_id')
            ->orderBy('data_pengajar_table.nama_lengkap asc')
            ->get()->getResultObject();
---
SELECT `kelompok_table`.`id`, `kelompok_table`.`kelompok`, `kelompok_table`.`mitra_pengajar_id`, `data_pengajar_table`.`nama_lengkap`
FROM `kelompok_table`
JOIN `data_pengajar_table` ON `data_pengajar_table`.`id` = `kelompok_table`.`mitra_pengajar_id`
ORDER BY `kelompok_table`.`id` desc