app/Models/Admin/MateriBelajarModel.php

SELECT `materi_belajar_table`.`id`, `materi_belajar_table`.`level`, `materi_belajar_table`.`program_belajar_id`, `program_belajar_table`.`nama_program`, `program_belajar_table`.`usia_anak`
FROM `materi_belajar_table`
LEFT JOIN `program_belajar_table` ON `program_belajar_table`.`id` = `materi_belajar_table`.`program_belajar_id`
ORDER BY `materi_belajar_table`.`id` desc
---
    public function getMateriBelajar()
    {
        return $this->table($this->table)
            ->select("materi_belajar_table.id, materi_belajar_table.level, materi_belajar_table.program_belajar_id, program_belajar_table.nama_program, program_belajar_table.usia_anak")
            ->join('program_belajar_table', 'program_belajar_table.id = materi_belajar_table.program_belajar_id', 'left')
            ->orderBy('materi_belajar_table.id desc')
            ->get()->getResultObject();