app/Models/Admin/MuridModel.php

    public function getDataMurid()
    {
        return $this->table($this->table)
            ->select("data_murid_table.id,data_murid_table.uid_murid,data_murid_table.nama_lengkap_anak, data_murid_table.tanggal_lahir_anak,  data_murid_table.alamat_domisili_anak, data_murid_table.sekolah_anak, data_murid_table.nomor_whatsapp_wali, data_murid_table.agama, data_murid_table. username_instagram_wali, data_murid_table.paket_belajar_id, data_murid_table.info_les,
            data_murid_table.program_belajar_id, data_murid_table.materi_belajar_id, data_murid_table.hari_belajar, data_murid_table.waktu_belajar, data_murid_table.foto_anak, data_murid_table.status_murid_id, status_murid_table.status_murid,materi_belajar_table.program_belajar_id, program_belajar_table.nama_program, paket_belajar_table.nama_paket, paket_belajar_table.jumlah_pertemuan")
            ->join('status_murid_table', 'status_murid_table.id = data_murid_table.status_murid_id')
            ->join('paket_belajar_table', 'paket_belajar_table.id = data_murid_table.paket_belajar_id', 'left')
            ->join('program_belajar_table', 'program_belajar_table.id = data_murid_table.program_belajar_id')
            ->join('materi_belajar_table', 'materi_belajar_table.id = data_murid_table.materi_belajar_id')
            ->orderBy('data_murid_table.status_murid_id ASC')
            ->orderBy('data_murid_table.nama_lengkap_anak ASC')
            ->get()->getResultObject();
---
SELECT `data_murid_table`.`id`, `data_murid_table`.`uid_murid`, `data_murid_table`.`nama_lengkap_anak`, `data_murid_table`.`tanggal_lahir_anak`, `data_murid_table`.`usia_anak`, `data_murid_table`.`alamat_domisili_anak`, `data_murid_table`.`sekolah_anak`, `data_murid_table`.`nomor_whatsapp_wali`, `data_murid_table`. `username_instagram_wali`, `data_murid_table`.`paket_belajar_id`, `data_murid_table`.`info_les`, `data_murid_table`.`brosur`, `data_murid_table`.`data`, `data_murid_table`.`program_belajar_id`, `data_murid_table`.`materi_belajar_id`, `data_murid_table`.`hari_belajar`, `data_murid_table`.`waktu_belajar`, `data_murid_table`.`foto_anak`, `data_murid_table`.`status_murid_id`, `status_murid_table`.`status_murid`, `materi_belajar_table`.`program_belajar_id`, `program_belajar_table`.`nama_program`, `paket_belajar_table`.`nama_paket`, `paket_belajar_table`.`jumlah_pertemuan`
FROM `data_murid_table`
JOIN `status_murid_table` ON `status_murid_table`.`id` = `data_murid_table`.`status_murid_id`
LEFT JOIN `paket_belajar_table` ON `paket_belajar_table`.`id` = `data_murid_table`.`paket_belajar_id`
JOIN `program_belajar_table` ON `program_belajar_table`.`id` = `data_murid_table`.`program_belajar_id`
JOIN `materi_belajar_table` ON `materi_belajar_table`.`id` = `data_murid_table`.`materi_belajar_id`
ORDER BY `id` desc

    public function getDataMuridWaiting()
    {
        return $this->table($this->table)
            ->select("data_murid_table.id,data_murid_table.uid_murid,data_murid_table.nama_lengkap_anak, data_murid_table.tanggal_lahir_anak,  data_murid_table.alamat_domisili_anak, data_murid_table.sekolah_anak, data_murid_table.nomor_whatsapp_wali, data_murid_table.agama, data_murid_table.username_instagram_wali, data_murid_table.program_belajar_id, data_murid_table.materi_belajar_id, data_murid_table.hari_belajar, data_murid_table.waktu_belajar, data_murid_table.foto_anak, data_murid_table.status_murid_id, status_murid_table.status_murid,materi_belajar_table.program_belajar_id, program_belajar_table.nama_program")
            ->join('status_murid_table', 'status_murid_table.id = data_murid_table.status_murid_id')
            ->join('materi_belajar_table', 'materi_belajar_table.id = data_murid_table.materi_belajar_id')
            ->join('program_belajar_table', 'program_belajar_table.id = data_murid_table.program_belajar_id')
            ->where(["data_murid_table.status_murid_id" => 3])
            ->orderBy('id desc')
            ->get()->getResultObject();
---
SELECT `data_murid_table`.`id`, `data_murid_table`.`uid_murid`, `data_murid_table`.`nama_lengkap_anak`, `data_murid_table`.`tanggal_lahir_anak`, `data_murid_table`.`usia_anak`, `data_murid_table`.`alamat_domisili_anak`, `data_murid_table`.`sekolah_anak`, `data_murid_table`.`nomor_whatsapp_wali`, `data_murid_table`. `username_instagram_wali`, `data_murid_table`.`program_belajar_id`, `data_murid_table`.`materi_belajar_id`, `data_murid_table`.`hari_belajar`, `data_murid_table`.`waktu_belajar`, `data_murid_table`.`foto_anak`, `data_murid_table`.`status_murid_id`, `status_murid_table`.`status_murid`, `materi_belajar_table`.`program_belajar_id`, `program_belajar_table`.`nama_program`
FROM `data_murid_table`
JOIN `status_murid_table` ON `status_murid_table`.`id` = `data_murid_table`.`status_murid_id`
JOIN `materi_belajar_table` ON `materi_belajar_table`.`id` = `data_murid_table`.`materi_belajar_id`
JOIN `program_belajar_table` ON `program_belajar_table`.`id` = `data_murid_table`.`program_belajar_id`
WHERE `data_murid_table`.`status_murid_id` = 3
ORDER BY `id` desc

    public function getDataMuridAktif()
    {
        return $this->table($this->table)
            ->select("data_murid_table.id,data_murid_table.uid_murid,data_murid_table.nama_lengkap_anak, data_murid_table.tanggal_lahir_anak,  data_murid_table.alamat_domisili_anak, data_murid_table.sekolah_anak, data_murid_table.nomor_whatsapp_wali, data_murid_table.agama, data_murid_table.username_instagram_wali, data_murid_table.program_belajar_id, data_murid_table.materi_belajar_id, data_murid_table.hari_belajar, data_murid_table.waktu_belajar, data_murid_table.foto_anak, data_murid_table.status_murid_id, status_murid_table.status_murid,materi_belajar_table.program_belajar_id, program_belajar_table.nama_program")
            ->join('status_murid_table', 'status_murid_table.id = data_murid_table.status_murid_id')
            ->join('materi_belajar_table', 'materi_belajar_table.id = data_murid_table.materi_belajar_id')
            ->join('program_belajar_table', 'program_belajar_table.id = data_murid_table.program_belajar_id')
            ->where(["data_murid_table.status_murid_id" => 1])
            ->orderBy('data_murid_table.id desc')
            ->get()->getResultObject();
---
SELECT `data_murid_table`.`id`, `data_murid_table`.`uid_murid`, `data_murid_table`.`nama_lengkap_anak`, `data_murid_table`.`tanggal_lahir_anak`, `data_murid_table`.`usia_anak`, `data_murid_table`.`alamat_domisili_anak`, `data_murid_table`.`sekolah_anak`, `data_murid_table`.`nomor_whatsapp_wali`, `data_murid_table`. `username_instagram_wali`, `data_murid_table`.`program_belajar_id`, `data_murid_table`.`materi_belajar_id`, `data_murid_table`.`hari_belajar`, `data_murid_table`.`waktu_belajar`, `data_murid_table`.`foto_anak`, `data_murid_table`.`status_murid_id`, `status_murid_table`.`status_murid`, `materi_belajar_table`.`program_belajar_id`, `program_belajar_table`.`nama_program`
FROM `data_murid_table`
JOIN `status_murid_table` ON `status_murid_table`.`id` = `data_murid_table`.`status_murid_id`
JOIN `materi_belajar_table` ON `materi_belajar_table`.`id` = `data_murid_table`.`materi_belajar_id`
JOIN `program_belajar_table` ON `program_belajar_table`.`id` = `data_murid_table`.`program_belajar_id`
WHERE `data_murid_table`.`status_murid_id` = 1
ORDER BY `id` desc

    public function getDataMuridPendaftaran()
    {
        return $this->table($this->table)
            ->select("data_murid_table.id,data_murid_table.uid_murid,data_murid_table.nama_lengkap_anak, data_murid_table.tanggal_lahir_anak,  data_murid_table.alamat_domisili_anak, data_murid_table.sekolah_anak, data_murid_table.nomor_whatsapp_wali, data_murid_table.agama, data_murid_table.username_instagram_wali, data_murid_table.program_belajar_id, data_murid_table.materi_belajar_id, data_murid_table.hari_belajar, data_murid_table.waktu_belajar, data_murid_table.foto_anak, data_murid_table.status_murid_id, status_murid_table.status_murid,materi_belajar_table.program_belajar_id, program_belajar_table.nama_program")
            ->join('status_murid_table', 'status_murid_table.id = data_murid_table.status_murid_id')
            ->join('materi_belajar_table', 'materi_belajar_table.id = data_murid_table.materi_belajar_id')
            ->join('program_belajar_table', 'program_belajar_table.id = data_murid_table.program_belajar_id')
            ->where(["data_murid_table.status_murid_id" => 2])
            ->orderBy('id desc')
            ->get()->getResultObject();
---
SELECT `data_murid_table`.`id`, `data_murid_table`.`uid_murid`, `data_murid_table`.`nama_lengkap_anak`, `data_murid_table`.`tanggal_lahir_anak`, `data_murid_table`.`usia_anak`, `data_murid_table`.`alamat_domisili_anak`, `data_murid_table`.`sekolah_anak`, `data_murid_table`.`nomor_whatsapp_wali`, `data_murid_table`. `username_instagram_wali`, `data_murid_table`.`program_belajar_id`, `data_murid_table`.`materi_belajar_id`, `data_murid_table`.`hari_belajar`, `data_murid_table`.`waktu_belajar`, `data_murid_table`.`foto_anak`, `data_murid_table`.`status_murid_id`, `status_murid_table`.`status_murid`, `materi_belajar_table`.`program_belajar_id`, `program_belajar_table`.`nama_program`
FROM `data_murid_table`
JOIN `status_murid_table` ON `status_murid_table`.`id` = `data_murid_table`.`status_murid_id`
JOIN `materi_belajar_table` ON `materi_belajar_table`.`id` = `data_murid_table`.`materi_belajar_id`
JOIN `program_belajar_table` ON `program_belajar_table`.`id` = `data_murid_table`.`program_belajar_id`
WHERE `data_murid_table`.`status_murid_id` = 2
ORDER BY `id` desc

    public function getDataMuridOff()
    {
        return $this->table($this->table)
            ->select("data_murid_table.id,data_murid_table.uid_murid,data_murid_table.nama_lengkap_anak, data_murid_table.tanggal_lahir_anak,  data_murid_table.alamat_domisili_anak, data_murid_table.sekolah_anak, data_murid_table.agama, data_murid_table.nomor_whatsapp_wali, data_murid_table.username_instagram_wali, data_murid_table.program_belajar_id, data_murid_table.materi_belajar_id, data_murid_table.hari_belajar, data_murid_table.waktu_belajar, data_murid_table.foto_anak, data_murid_table.status_murid_id, status_murid_table.status_murid,materi_belajar_table.program_belajar_id, program_belajar_table.nama_program")
            ->join('status_murid_table', 'status_murid_table.id = data_murid_table.status_murid_id')
            ->join('materi_belajar_table', 'materi_belajar_table.id = data_murid_table.materi_belajar_id')
            ->join('program_belajar_table', 'program_belajar_table.id = data_murid_table.program_belajar_id')
            ->where(["data_murid_table.status_murid_id" => 4])
            ->orderBy('id desc')
            ->get()->getResultObject();
---
SELECT `data_murid_table`.`id`, `data_murid_table`.`uid_murid`, `data_murid_table`.`nama_lengkap_anak`, `data_murid_table`.`tanggal_lahir_anak`, `data_murid_table`.`usia_anak`, `data_murid_table`.`alamat_domisili_anak`, `data_murid_table`.`sekolah_anak`, `data_murid_table`.`nomor_whatsapp_wali`, `data_murid_table`. `username_instagram_wali`, `data_murid_table`.`program_belajar_id`, `data_murid_table`.`materi_belajar_id`, `data_murid_table`.`hari_belajar`, `data_murid_table`.`waktu_belajar`, `data_murid_table`.`foto_anak`, `data_murid_table`.`status_murid_id`, `status_murid_table`.`status_murid`, `materi_belajar_table`.`program_belajar_id`, `program_belajar_table`.`nama_program`
FROM `data_murid_table`
JOIN `status_murid_table` ON `status_murid_table`.`id` = `data_murid_table`.`status_murid_id`
JOIN `materi_belajar_table` ON `materi_belajar_table`.`id` = `data_murid_table`.`materi_belajar_id`
JOIN `program_belajar_table` ON `program_belajar_table`.`id` = `data_murid_table`.`program_belajar_id`
WHERE `data_murid_table`.`status_murid_id` = 4
ORDER BY `id` desc