app/Models/Admin/PengajarModel.php

SELECT `data_pengajar_table`.`id`, `data_pengajar_table`.`uid`, `data_pengajar_table`.`nama_lengkap`, `data_pengajar_table`.`email`, `data_pengajar_table`.`usia`, `data_pengajar_table`.`alamat_domisili`, `data_pengajar_table`.`pendidikan_terakhir`, `data_pengajar_table`.`jurusan`, `status_perkawinan`, `data_pengajar_table`.`nomor_whatsapp`, `data_pengajar_table`.`username_instagram`, `data_pengajar_table`.`foto`, `data_pengajar_table`.`cv`, `data_pengajar_table`.`status_id`, `status_pengajar_table`.`status_pengajar`
FROM `data_pengajar_table`
JOIN `status_pengajar_table` ON `status_pengajar_table`.`id` = `data_pengajar_table`.`status_id`
ORDER BY `id` desc
---
    public function getDataPengajar()
    {
        return $this->table($this->table)
            ->select("data_pengajar_table.id, data_pengajar_table.uid, data_pengajar_table.nama_lengkap, data_pengajar_table.email, data_pengajar_table.usia, data_pengajar_table.alamat_domisili, data_pengajar_table.pendidikan_terakhir, data_pengajar_table.jurusan, status_perkawinan, data_pengajar_table.nomor_whatsapp, data_pengajar_table.username_instagram, data_pengajar_table.foto, data_pengajar_table.cv, data_pengajar_table.status_id, status_pengajar_table.status_pengajar")
            ->join('status_pengajar_table', 'status_pengajar_table.id = data_pengajar_table.status_id')
            ->orderBy('id desc')
            ->get()->getResultObject();

SELECT `data_pengajar_table`.`id`, `data_pengajar_table`.`uid`, `data_pengajar_table`.`nama_lengkap`, `data_pengajar_table`.`email`, `data_pengajar_table`.`usia`, `data_pengajar_table`.`alamat_domisili`, `data_pengajar_table`.`pendidikan_terakhir`, `data_pengajar_table`.`jurusan`, `status_perkawinan`, `data_pengajar_table`.`nomor_whatsapp`, `data_pengajar_table`.`username_instagram`, `data_pengajar_table`.`foto`, `data_pengajar_table`.`cv`, `data_pengajar_table`.`status_id`, `status_pengajar_table`.`status_pengajar`
FROM `data_pengajar_table`
JOIN `status_pengajar_table` ON `status_pengajar_table`.`id` = `data_pengajar_table`.`status_id`
WHERE `data_pengajar_table`.`status_id` = 2
ORDER BY `id` desc
---
    public function getDataPengajarStatusWaiting()
    {
        return $this->table($this->table)
            ->select("data_pengajar_table.id, data_pengajar_table.uid, data_pengajar_table.nama_lengkap, data_pengajar_table.email, data_pengajar_table.usia, data_pengajar_table.alamat_domisili, data_pengajar_table.pendidikan_terakhir, data_pengajar_table.jurusan, status_perkawinan, data_pengajar_table.nomor_whatsapp, data_pengajar_table.username_instagram, data_pengajar_table.foto, data_pengajar_table.cv, data_pengajar_table.status_id, status_pengajar_table.status_pengajar")
            ->join('status_pengajar_table', 'status_pengajar_table.id = data_pengajar_table.status_id')
            ->where(["data_pengajar_table.status_id" => 2])
            ->orderBy('id desc')
            ->get()->getResultObject();

SELECT `data_pengajar_table`.`id`, `data_pengajar_table`.`uid`, `data_pengajar_table`.`nama_lengkap`, `data_pengajar_table`.`email`, `data_pengajar_table`.`usia`, `data_pengajar_table`.`alamat_domisili`, `data_pengajar_table`.`pendidikan_terakhir`, `data_pengajar_table`.`jurusan`, `status_perkawinan`, `data_pengajar_table`.`nomor_whatsapp`, `data_pengajar_table`.`username_instagram`, `data_pengajar_table`.`foto`, `data_pengajar_table`.`cv`, `data_pengajar_table`.`status_id`, `status_pengajar_table`.`status_pengajar`
FROM `data_pengajar_table`
JOIN `status_pengajar_table` ON `status_pengajar_table`.`id` = `data_pengajar_table`.`status_id`
WHERE `data_pengajar_table`.`status_id` = 1
ORDER BY `id` desc
---
    public function getDataPengajarStatusAktif()
    {
        return $this->table($this->table)
            ->select("data_pengajar_table.id, data_pengajar_table.uid, data_pengajar_table.nama_lengkap, data_pengajar_table.email, data_pengajar_table.usia, data_pengajar_table.alamat_domisili, data_pengajar_table.pendidikan_terakhir, data_pengajar_table.jurusan, status_perkawinan, data_pengajar_table.nomor_whatsapp, data_pengajar_table.username_instagram, data_pengajar_table.foto, data_pengajar_table.cv, data_pengajar_table.status_id, status_pengajar_table.status_pengajar")
            ->join('status_pengajar_table', 'status_pengajar_table.id = data_pengajar_table.status_id')
            ->where(["data_pengajar_table.status_id" => 1])
            ->orderBy('id desc')
            ->get()->getResultObject();

SELECT `data_pengajar_table`.`id`, `data_pengajar_table`.`uid`, `data_pengajar_table`.`nama_lengkap`, `data_pengajar_table`.`email`, `data_pengajar_table`.`usia`, `data_pengajar_table`.`alamat_domisili`, `data_pengajar_table`.`pendidikan_terakhir`, `data_pengajar_table`.`jurusan`, `status_perkawinan`, `data_pengajar_table`.`nomor_whatsapp`, `data_pengajar_table`.`username_instagram`, `data_pengajar_table`.`foto`, `data_pengajar_table`.`cv`, `data_pengajar_table`.`status_id`, `status_pengajar_table`.`status_pengajar`
FROM `data_pengajar_table`
JOIN `status_pengajar_table` ON `status_pengajar_table`.`id` = `data_pengajar_table`.`status_id`
WHERE `data_pengajar_table`.`status_id` = 1
ORDER BY `id` desc
 LIMIT 4
---
    public function getDatPengajarLimitData()
    {
        return $this->table($this->table)
            ->select("data_pengajar_table.id, data_pengajar_table.uid, data_pengajar_table.nama_lengkap, data_pengajar_table.email, data_pengajar_table.usia, data_pengajar_table.alamat_domisili, data_pengajar_table.pendidikan_terakhir, data_pengajar_table.jurusan, status_perkawinan, data_pengajar_table.nomor_whatsapp, data_pengajar_table.username_instagram, data_pengajar_table.foto, data_pengajar_table.cv, data_pengajar_table.status_id, status_pengajar_table.status_pengajar")
            ->join('status_pengajar_table', 'status_pengajar_table.id = data_pengajar_table.status_id')
            ->where(["data_pengajar_table.status_id" => 1])
            ->limit(4)
            ->orderBy('id desc')
            ->get()->getResultObject();