app/Models/Admin/PresensiModel.php

SELECT `presensi_table`.`id`, `presensi_table`.`tanggal_masuk`, `presensi_table`.`jam_masuk`, `presensi_table`.`dokumentasi`, `data_pengajar_table`.`nama_lengkap`, `data_murid_table`.`nama_lengkap_anak`
FROM `presensi_table`
JOIN `data_pengajar_table` ON `data_pengajar_table`.`id` = `presensi_table`.`mitra_pengajar_id`
JOIN `data_murid_table` ON `data_murid_table`.`id` = `presensi_table`.`peserta_didik_id`
ORDER BY `presensi_table`.`tanggal_masuk` desc
---
    public function getDataPresensi()
    {
        return $this->table($this->table)
            ->select("presensi_table.id, presensi_table.tanggal_masuk, presensi_table.jam_masuk, presensi_table.dokumentasi, presensi_table.dokumentasi_orang_tua,data_pengajar_table.nama_lengkap, data_murid_table.nama_lengkap_anak")
            ->join('data_pengajar_table', 'data_pengajar_table.id = presensi_table.mitra_pengajar_id')
            ->join('data_murid_table', 'data_murid_table.id = presensi_table.peserta_didik_id')
            ->orderBy('presensi_table.tanggal_masuk desc')
            ->get()->getResultObject();