app/Models/Admin/ProgramBelajarModel.php

SELECT `program_belajar_table`.`id`, `program_belajar_table`.`nama_program`, `program_belajar_table`.`usia_anak`, `program_belajar_table`.`banner`
FROM `program_belajar_table`
ORDER BY `program_belajar_table`.`id` desc
---
    public function getProgramBelajar()
    {
        return $this->table($this->table)
            ->select("program_belajar_table.id, program_belajar_table.nama_program, program_belajar_table.usia_anak, program_belajar_table.banner")
            ->orderBy('program_belajar_table.id desc')
            ->get()->getResultObject();