app/Models/Admin/UserManagementModel.php

    public function getUserManagement()
    {
        return $this->table($this->table)
            ->select('users_management_table.id, users_management_table.mitra_pengajar_id, users_management_table.email,users_management_table.password, users_management_table.role_management_id, data_pengajar_table.nama_lengkap, role_management_table.role_management, data_pengajar_table.status_id, data_pengajar_table.status_id, status_pengajar_table.status_pengajar')
            ->join('data_pengajar_table', 'data_pengajar_table.id = users_management_table.mitra_pengajar_id')
            ->join('status_pengajar_table', 'status_pengajar_table.id = data_pengajar_table.status_id')
            ->join('role_management_table', 'role_management_table.id = users_management_table.role_management_id')
            ->orderBy('id desc')
            ->get()->getResultObject();
---
SELECT `users_management_table`.`id`, `users_management_table`.`mitra_pengajar_id`, `users_management_table`.`email`, `users_management_table`.`password`, `users_management_table`.`role_management_id`, `data_pengajar_table`.`nama_lengkap`, `role_management_table`.`role_management`
FROM `users_management_table`
JOIN `data_pengajar_table` ON `data_pengajar_table`.`id` = `users_management_table`.`mitra_pengajar_id`
JOIN `role_management_table` ON `role_management_table`.`id` = `users_management_table`.`role_management_id`
ORDER BY `id` desc

    public function getUserManagementData($email, $password)
    {
        return $this->table($this->table)
            ->select('users_management_table.id, users_management_table.mitra_pengajar_id, users_management_table.email,users_management_table.password, users_management_table.role_management_id, data_pengajar_table.nama_lengkap, data_pengajar_table.foto, role_management_table.role_management')
            ->join('data_pengajar_table', 'data_pengajar_table.id = users_management_table.mitra_pengajar_id')
            ->join('role_management_table', 'role_management_table.id = users_management_table.role_management_id')
            ->where(["users_management_table.email" => $email])
            ->where(["users_management_table.password" => $password])
            ->orderBy('users_management_table.id desc')
            ->get()->getRowObject();
---
SELECT `users_management_table`.`id`, `users_management_table`.`mitra_pengajar_id`, `users_management_table`.`email`, `users_management_table`.`password`, `users_management_table`.`role_management_id`, `data_pengajar_table`.`nama_lengkap`, `data_pengajar_table`.`foto`, `role_management_table`.`role_management`
FROM `users_management_table`
JOIN `data_pengajar_table` ON `data_pengajar_table`.`id` = `users_management_table`.`mitra_pengajar_id`
JOIN `role_management_table` ON `role_management_table`.`id` = `users_management_table`.`role_management_id`
WHERE `users_management_table`.`email` = 'chanchanbayub@gmail.com'
AND `users_management_table`.`password` = '@chanchanbayub'
ORDER BY `users_management_table`.`id` desc